Revit.Elements.ReferencePoint
A Revit Reference Point

Revit.Elements.ReferencePoint.#ctor(Autodesk.Revit.DB.ReferencePoint)
Internal constructor for wrapping a ReferencePoint.
refPt:

Revit.Elements.ReferencePoint.#ctor(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.UV)
Internal constructor for ReferencePoint Elements that a persistent relationship to a Face
faceReference:
uv:

Revit.Elements.ReferencePoint.#ctor(Autodesk.Revit.DB.Reference,System.Double,Autodesk.Revit.DB.PointOnCurveMeasurementType,Autodesk.Revit.DB.PointOnCurveMeasureFrom)
Internal constructor for ReferencePoint Elements that a persistent relationship to a Curve
curveReference:
parameter:
measurementType:
measureFrom:

Revit.Elements.ReferencePoint.#ctor(Autodesk.Revit.DB.XYZ)
Internal constructor for the ReferencePoint
xyz:

Revit.Elements.ReferencePoint.InitReferencePoint(Autodesk.Revit.DB.ReferencePoint)
Initialize a ReferencePoint element
refPt:

Revit.Elements.ReferencePoint.InitReferencePoint(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.UV)
Initialize a ReferencePoint element
faceReference:
uv:

Revit.Elements.ReferencePoint.InitReferencePoint(Autodesk.Revit.DB.Reference,System.Double,Autodesk.Revit.DB.PointOnCurveMeasurementType,Autodesk.Revit.DB.PointOnCurveMeasureFrom)
Initialize a ReferencePoint element
curveReference:
parameter:
measurementType:
measureFrom:

Revit.Elements.ReferencePoint.InitReferencePoint(Autodesk.Revit.DB.XYZ)
Initialize a ReferencePoint element
xyz:

Revit.Elements.ReferencePoint.ByCoordinates(System.Double,System.Double,System.Double)
Create a Reference Point by x, y, and z coordinates.
x:
y:
z:
Returns:

Revit.Elements.ReferencePoint.ByPoint(Autodesk.DesignScript.Geometry.Point)
Create a Reference Point from a point.
pt:
Returns:

Revit.Elements.ReferencePoint.ByPointVectorDistance(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Create a Reference Point Element offset from a point along a vector
basePoint:
direction:
distance:
Returns:

Revit.Elements.ReferencePoint.ByLengthOnCurveReference(System.Object,System.Double)
Create a Reference Point at a particular length along a curve
elementCurveReference:
length: Distance in meters along the curve
Returns:

Revit.Elements.ReferencePoint.ByParameterOnCurveReference(System.Object,System.Double)
Create a Reference Point at a parameter on an Curve.  This introduces a persistent relationship between
Elements in the Revit document.
elementCurveReference:
parameter:
Returns:

Revit.Elements.ReferencePoint.ByParametersOnFaceReference(System.Object,System.Double,System.Double)
Create a Reference Point by UV coordinates on a Face. This introduces a persistent relationship between
Elements in the Revit document.
elementFaceReference:
u:
v:
Returns:

Revit.Elements.ReferencePoint.FromExisting(Autodesk.Revit.DB.ReferencePoint,System.Boolean)
Create a Reference Point from a user selected Element.
pt:
isRevitOwned:
Returns:

Revit.Elements.ReferencePoint.Autodesk#DesignScript#Interfaces#IGraphicItem#Tessellate(Autodesk.DesignScript.Interfaces.IRenderPackage,Autodesk.DesignScript.Interfaces.TessellationParameters)
Tessellate Reference Point to render package for visualization.

Revit.Elements.ReferencePoint.InternalReferencePoint
Internal variable containing the wrapped Revit object

Revit.Elements.ReferencePoint.InternalElement
Reference to the Element

Revit.Elements.ReferencePoint.X
Gets 'X' coordinate of the specified ReferencePoint

Revit.Elements.ReferencePoint.Y
Gets 'Y' coordinate of the specified ReferencePoint

Revit.Elements.ReferencePoint.Z
Gets 'Z' coordinate of the specified ReferencePoint

Revit.Elements.ReferencePoint.Point
Gets point geometry from the specified ReferencePoint

Revit.Elements.ReferencePoint.XYPlane
Gets XY plane of the specified ReferencePoint

Revit.Elements.ReferencePoint.YZPlane
Gets YZ plane of the specified ReferencePoint

Revit.Elements.ReferencePoint.XZPlane
Gets XZ plane of the specified ReferencePoint